{
    "sectionName": "Projets",
    "projects": [
        {
            "id": 14,
            "title": "Neorush",
            "subtitle": "Jeu multijoueur de motos (remake de Tron)",
            "carousel_content": [
                    {
                        "type": "photo",
                        "filename": "/Neorush/Screenshot_Gameplay4Joueurs.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Neorush/Screenshot_DeathScreen.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Neorush/Screenshot_Score.png"
                    },                 
                    {
                        "type": "photo",
                        "filename": "/Neorush/Screenshot_Menu.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Neorush/Screenshot_Partez.png"
                    }
                    
                ],
            "badges": [
                "Equipe de 6",
                "2 mois",
                "Unreal Engine"
            ],
            "description": [
                "*Neorush* est un jeu de combat de motos en multijoueur local (jusqu'à 4 joueurs) où les joueurs doivent bloquer les autres avec leur trainée lumineuse. Ce jeu est un remake 3D du jeu d'arcade Tron. Les joueurs peuvent s'affronter entre eux, et affronter des motos contrôlées par l'ordinateur.",
                "Durant ce projet, j'ai principalement travaillé sur les IA des motos adverses. J'ai utilisé le framework IA d'Unreal avec les behavior tree, ainsi que l'EQS (environment query system), afin de donner un comportement intéressant aux IA. Elles ont un comportement défensif en évitant les trainées sur le terrain, mais sont aggressives envers les autres joueurs quand l'opportunité se présente. J'ai également participé au design des UI, et implémenté l'écran de fin de partie.",
                "*Page itch.io en construction, vidéo à venir*"
            ],
            "color": "#c86060",
            "projectType": "Projet UQAC"
        },
        {
            "id": 13,
            "title": "XSpin",
            "subtitle": "Jeu multijoueur de combat de toupies",
            "carousel_content": [
                    {
                        "type": "video",
                        "filename": "/XSpin.mp4"
                    }                       
                ],
            "badges": [
                "Equipe de 5",
                "1 trimestre",
                "Unreal Engine"
            ],
            "description": [
                "*XSpin* est un jeu de combat de toupies où les joueurs (2 à 4) s’affrontent dans une arène dynamique, en utilisant diverses capacités.",
                "J'ai implémenté les éléments dynamiques des arènes : les bumpers et flipper bats de l'arène flipper, ainsi que les canons de l'arène pirate (en utilisant le framework IA d'Unreal). J'ai implémenté la caméra dynamique, travaillé sur les UI et les cinématiques d'introduction des niveaux. J'ai également fait quelques modèles 3D (bumper et flipper bat) ainsi que des VFX (fumée des canons et vent de l'arène pirate).",
                "*Page itch.io en construction*"
            ],
            "color": "#39ccbb",
            "projectType": "Projet UQAC"
        },
        {
            "id": 12,
            "title": "Bowling Builder",
            "subtitle": "Bowling stratégique en VR",
            "carousel_content": [
                    {
                        "type": "youtube",
                        "filename": "https://www.youtube.com/embed/k_tGYnsshRg?si=ZM2K87gCZm-OFnw0"
                    }
                ],
            "badges": [
                "Equipe de 3",
                "1 trimestre",
                "Unity"
            ],
            "description": [
                "*Bowling Builder* est un jeu de bowling stratégique en réalité virtuelle, dans lequel le joueur doit placer des blocs pour dévier la balle et faire tomber les quilles. Il peut aussi dévier la trajectoire de la balle quand elle est lancée en penchant la tête. Le jeu contient 3 niveaux et un tutoriel ayant chacun ses obstacles (douves, murs) et défis.",
                "J'ai travaillé sur la partie 'bowling' du projet, à savoir attraper et lancer la balle sur les quilles, avoir une zone de lancer, faire réapparaître la balle quand elle sort du terrain, et gérer le score. J'ai aussi fait le niveau tutoriel et travaillé sur le niveau 1, ainsi qu'ajouté les feedbacks visuels, sonores et haptiques relatifs à cette partie du jeu."
            ],
            "color": "#ea8b27c1",
            "link": "https://github.com/IDalb/BowlingBuilder",
            "linkType": "Page Github",
            "projectType": "Projet UQAC"
        },
        {
            "id": 11,
            "title": "Atubu",
            "subtitle": "Application mobile : traqueur de consommation d'eau",
            "carousel_content": [
                    {
                        "type": "photo",
                        "filename": "/Atubu/Atubu1.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Atubu/Atubu2.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Atubu/Atubu3.png"
                    }
                ],
            "badges": [
                "Equipe de 4",
                "1 trimestre",
                "Android studio"
            ],
            "description": [
                "*Atubu* est une application mobile permettant de traquer sa consommation d'eau de façon ludique, à l'aide d'un avatar qui reflète notre niveau d'hydratation. Il est possible d'indiquer la quantité d'eau qu'on a bue chaque jour grâce à des verres qu'on peut personnaliser, on peut recevoir des notifications nous rappelant de boire, ajouter un widget de notre plante, et consulter notre jardin (calendrier).",
                "J'ai travaillé sur la page d'accueil, comprenant la gestion de la jauge d'eau, de la plante et des verres, les changements d'unités de mesure, ainsi qu'une partie de la page jardin."
            ],
            "color": "#58a826c1",
            "link": "https://github.com/Hel88/Atubu",
            "linkType": "Page Github",
            "projectType": "Projet UQAC"
        },
        {
            "id": 10,
            "title": "Melty",
            "subtitle": "Wonderjam édition hiver 2025",
            "carousel_content": [
                    {
                        "type": "photo",
                        "filename": "/Melty/melty1.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Melty/melty2.png"
                    },
                    {
                        "type": "photo",
                        "filename": "/Melty/melty3.png"
                    },
                    {
                        "type": "video",
                        "filename": "/Melty/Melty.mp4"
                    }                    
                ],
            "badges": [
                "Equipe de 4",
                "48 heures (game jam)",
                "Unreal engine (Blueprint)"
            ],
            "description": [
                "Le joueur incarne un glaçon qui cherche à rejoindre un bateau sur la plage avant de fondre. La carte est divisée en plusieurs zones de plus en plus chaudes, et le joueur doit récolter des flocons pour augmenter sa résistance à la chaleur à chaque nouvelle partie. ",
                "J'ai travaillé sur le système de collectible/quêtes, ainsi que sur les UI.",
                "Ce jeu a été réalisé lors de la Wonderjam d'hiver 2025 organisée par l'AEMU-UQAC, propulsée par Ubisoft Saguenay. Le thème de l'édition était 'Frontières', et les styles que nous avons tirés au hasard sont 'collecteurs', 'rogue-lite' et 'quête'."
            ],
            "color": "#39ccbb",
            "link": "https://kiribaton.itch.io/melty",
            "linkType": "Page itch.io",
            "projectType": "Game jam"
        },
        {
            "id": 1,
            "title": "Lift to Heaven",
            "award": true,
            "subtitle": "Code game jam 2025 - 1ère place",
            "carousel_content": [
                {
                    "type": "photo",
                    "filename": "lifttoheaven/liftToHeaven1.png"
                },
                {
                    "type": "photo",
                    "filename": "lifttoheaven/liftToHeaven2.png"
                },
                {
                    "type": "video",
                    "filename": "lifttoheaven/liftToHeaven3.mp4"
                },
                {
                    "type": "video",
                    "filename": "lifttoheaven/liftToHeaven4.mp4"
                }
            ],
            "badges": [
                "Equipe de 3",
                "30 heures (game jam)",
                "Unreal engine (Blueprint)"
            ],
            "description": [
                "Dans *Lift to Heaven*, le joueur doit s'assurer que la musique de l'ascenceur continue en appuyant sur le bon bouton. Il doit les chercher dans des boîtes qui se débloquent au fur et à mesure, sous un chapeau ou un tapis afin d'augmenter le volume de la musique et monter le plus haut possible.",
                "J'ai implémenté la mécanique principale et le gameplay, ainsi que les menus.",
                "Ce jeu a été créé pour la Code Game Jam 2025 de l'IUT de Montpellier. Le thème était *Mélodie à l'infini*. Il a remporté la **1ʳᵉ place** parmi 68 équipes."
            ],
            "color": "#ea8b27c1",
            "link": "https://kiribaton.itch.io/lifttoheaven",
            "linkType": "Page itch.io",
            "projectType": "Game jam"
        },
        {
            "id": 2,
            "title": "Frogy Frog",
            "subtitle": "Un plateformer amphibien",
            "carousel_content": [
                {
                    "type": "photo",
                    "filename": "Frog/frog3.png"
                },
                {
                    "type": "video",
                    "filename": "Frog/frogyfrog_gameplay.mp4"
                },
                {
                    "type": "photo",
                    "filename": "Frog/frog2.png"
                },
                {
                    "type": "photo",
                    "filename": "Frog/frog4.png"
                }
            ],
            "badges": [
                "Equipe de 3",
                "5 semaines",
                "Unreal engine (C++, Blueprint)"
            ],
            "description": [
                "Dans ce jeu solo, le joueur contrôle une petite grenouille qui doit s'échapper de la cuisine pour ne pas passer à la casserole, en utilisant sa langue comme un grappin.",
                "J'ai travaillé sur le mécanisme du grappin, ainsi que sur les déplacements de la grenouille et l'intégration des animations du pack d'assets."
            ],
            "color": "#58a826c1",
            "link": "https://mathis-ollier.itch.io/frogyfrog",
            "linkType": "Page itch.io",
            "projectType": "Projet UQAC"
        },
        {
            "id": 3,
            "title": "Shroomboom",
            "subtitle": "Jeu bomberman",
            "carousel_content": [
                {
                    "type": "video",
                    "filename": "Bomberman/bomberman_prise1.mp4"
                }
               
            ],
            "badges": [
                "Equipe de 3",
                "2 semaines",
                "Unreal engine (C++, Blueprint)"
            ],
            "description": [
                "Ce projet est basé sur le célèbre jeu Bomberman. C'est un jeu compétitif pour 2 à 4 joueurs, où les joueurs (des champignons ici) doivent éliminer les autres en posant des bombes. Cette version inclut deux types de bonus.",
                "J'ai travaillé sur les déplacements des joueurs, les éléments de l'interface utilisateur et le design du jeu."
            ],
            "color": "#b33e17c1",
            "projectType": "Projet UQAC"
        },
      
        {
            "id": 5,
            "title": "Reconnaissance de la langue des signes américaine",
            "subtitle": "Application pour un cours de machine learning",
            "carousel_content": [
                {
                    "type": "photo",
                    "filename": "signlanguage.png"
                }
            ],
            "badges": [
                "Equipe de 3",
                "3 semaines",
                "Python (tkinter, scikit-learn)"
            ],
            "description": [
                "Cette application permet d'apprendre l'alphabet de la langue des signes américaine, et a été réalisée dans le cadre d'un cours de machine learning. Nous avons utilisé un jeu de données d'images provenant de Kaggle, extrait leurs caractéristiques et entraîné un classificateur à forêts aléatoires.",
                "J'ai travaillé sur l'interface utilisateur ainsi que sur l'intégration du modèle dans le projet."
            ],
            "color": "#1b6d9ac1",
            "link": "https://github.com/Hel88/SignLanguageAlphabetRecognition",
            "linkType": "Page Github",
            "projectType": "Projet UQAC"
        },
        {
            "id": 6,
            "title": "Interface Intelligente de Recherche de Symptômes et Traitements Médicamenteux",
            "subtitle": "Project pour un cours de masses de données",
            "badges": [
                "Equipe de 3",
                "1 semaine",
                "Java"
            ],
            "description": [
                "Ce projet est une interface graphique interactive conçue pour aider les utilisateurs à identifier des maladies potentielles en fonction des symptômes ou des effets secondaires signalés. L'interface interroge différentes sources de données, telles que des bases médicales, des fichiers indexés et des documents textuels, en fonction des entrées de l'utilisateur.",
                "L'un des défis de ce projet a été d'analyser les nombreuses données issues de cinq sources différentes afin d'identifier les informations pertinentes et d'établir des liens significatifs entre elles."
            ],
            "color": "#6c757d",
            "link": "https://github.com/TheoHorn/gmd_project",
            "linkType": "Page Github",
            "projectType": "Projet Telecom Nancy"
        },
        {
            "id": 7,
            "title": "Détection de marqueurs corporels en temps réel avec mediapipe",
            "subtitle": "Projet de découverte de la recherche",
            "badges": [
                "Equipe de 2",
                "1 semestre",
                "Python (mediapipe)"
            ],
            "description": [
                "J'ai travaillé sur les premières phases d'un projet de recherche, qui est un jeu sérieux de remobilisation corporelle pour les personnes âgées. Le but était de détecter les angles corporels à l'aide d'une webcam basique, une installation minimale. Nous avons effectué un état de l'art des technologies existantes de détection de marqueurs corporels et, après les avoir testé, avons déterminé celle qui sera la plus pertinente pour ce projet."
            ],
            "color": "#6c757d",
            "projectType": "Projet Telecom Nancy"
        },
        {
            "id": 8,
            "title": "Direct Dealing",
            "subtitle": "Application d'emprunt de matériel",
            "badges": [
                "Equipe de 4",
                "5 jours (coding week)",
                "Java (JavaFX)"
            ],
            "description": [
                "DirectDealing est une application d'économie circulaire qui permet aux utilisateurs de prêter/emprunter du matériel (tondeuse, marteau-piqueur, éplucheur de légumes, etc.) et/ou d'offrir/demander des services (réparation d'une fuite d'eau, cours de piano, aide au déménagement, etc.).",
                "Elle a été réalisée en cinq jours lors d'un challenge de coding week organisé par Telecom Nancy."
            ],
            "link": "https://github.com/Hel88/Codingweek2024",
            "linkType": "Page Github",
            "color": "#6c757d",
            "projectType": "Projet Telecom Nancy"
        },
        {
            "id": 9,
            "title": "Le bonheur est dans le potager",
            "subtitle": "Application web de gestion de jardin partagé",
            "badges": [
                "Equipe de 4",
                "1 semestre",
                "Python (Flask)"
            ],
            "description": [
                "*Le bonheur est dans le potager* est une application web permettant aux utilisateurs de rejoindre un jardin partagé, de posséder une parcelle et d’y ajouter des plantes. Un algorithme donne des conseils sur les associations de plantes favorables et suggère un agencement optimal dans la parcelle."],
            "color": "#6c757d",
            "projectType": "Projet Telecom Nancy"
        }
    ]
}